vapix/onvif-request/app/set-video-source/SetVideoEncoderConfiguration.xml

<!-- Endpoint: /vapix/services -->

<!-- Request  SetVideoEncoderConfiguration -->

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope">
    <Header/>
    <Body >
        <tr2:SetVideoEncoderConfiguration xmlns:tr2="http://www.onvif.org/ver20/media/wsdl"
            xmlns="http://www.onvif.org/ver10/schema">
            <tr2:Configuration token="default_1_h264" GovLength="32" Profile="Main">
                <UseCount>0</UseCount>
                <Name>default_1 h264</Name>
                <Encoding>H264</Encoding>
                <Resolution>
                    <Width>3840</Width>
                    <Height>2160</Height>
                </Resolution>
                <RateControl>
                    <FrameRateLimit>25</FrameRateLimit>
                    <BitrateLimit>2147483647</BitrateLimit>
                </RateControl>
                <Quality>70</Quality>
                <Multicast>
                    <Address>
                        <Type>IPv4</Type>
                        <IPv4Address>224.0.0.90</IPv4Address>

                    </Address>
                    <Port>9090</Port>
                    <TTL>5</TTL>
                    <AutoStart>false</AutoStart>
                </Multicast>
            </tr2:Configuration>
        </tr2:SetVideoEncoderConfiguration>
    </Body>
</Envelope>

<!-- Response SetVideoEncoderConfigurationResponse -->

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:tns1="http://www.onvif.org/ver10/topics"
    xmlns:tnsaxis="http://www.axis.com/2009/event/topics"
    xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
    xmlns:tr2="http://www.onvif.org/ver20/media/wsdl"
    xmlns:axt="http://www.onvif.org/ver20/analytics"
    xmlns:ter="http://www.onvif.org/ver10/error">
    <SOAP-ENV:Header></SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <tr2:SetVideoEncoderConfigurationResponse></tr2:SetVideoEncoderConfigurationResponse>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>